{
  "name": "Miguel Rubiano",
  "logo_name": "xArkqngel",
  "role": "Systems Engineer",
  "about": {
    "sections": {
      "professional-info": {
        "title": "professional-info",
        "icon": "icons/info-professional.svg",
        "info": {
          "experience": {
            "title": "experience",
            "description": "<br>Computer and Systems Engineer with 2 years of frontend experience. Throughout this adventure, I've collaborated with my team on different labors such as backend, design, and database management, always looking to learn from this. I like to explore new technologies that allow me to build sustainable and scalable applications.",
            "files": {
              "freelance": "<br>January 2025 - Present <br><br> I am currently developing a web application for a freelance client, focusing on creating a user-friendly interface and efficient data management. I am responsible for the UI/UX design and development using multiple technologies and frameworks, ensuring a seamless user experience and responsive design. ",
              "sostecnible": "<br>July 2023 - December 2024<br><br>Responsible for developing and maintaining the front-end of the enterprise application using React and NextJS, with a focus on creating an efficient and user-friendly interface.<br><br> - Developed reusable components and functionality to support a scalable application architecture.<br> - Implemented internationalization features, including dictionaries for different languages, extending the scope of the application to global markets.<br>Developed interfaces for 3 new types of users, increasing accessibility and satisfaction by 20%.<br> - Integrated the visualization of Gantt charts through Syncfussion, streamlining project management and tracking processes.",
              "datacomputo": "<br>February 2022 - August 2022<br><br>  Responsible for the development and maintenance of static websites for different companies, using HTML, CSS, Javascript and Bootstrap or website builders such as Wix or GoDaddy, according to the user's needs.<br><br> - Developed and maintained static websites for several companies, ensuring a professional and accessible online presence.<br> - Collaborated in the maintenance and assembly of networks and computer equipment in the companies' facilities, improving operational efficiency.<br> - Managed the uploading and organization of documents requested by governmental entities, ensuring regulatory compliance."
            }
          },
          "hard-skills": {
            "title": "hard-skills",
            "description": "<br>My technical expertise spans modern web development frameworks and cloud computing. I am proficient in React, Next.js, Nest.js, and Node.js, with strong knowledge of TypeScript and JavaScript. My experience includes working with database technologies like PostgreSQL, MongoDB, and Oracle, leveraging Sequelize and Prisma for efficient ORM management. I am skilled in cloud solutions, particularly AWS, and have integrated cloud-based services into applications. Additionally, I have experience using Ant Design, Git, and GitHub, ensuring efficient version control and UI development.",
            "files": {
              "frontend": "<br> React - Next - TypeScript - Tailwind - Astro - HTML - CSS - Figma - Bootstrap - SCSS - MUI - Ant Design - Zustand - Bootstrap - Jest - Cypress",
              "backend": " <br> Nest - Node - GraphQL - REST - TypeORM - TypeGraphQL - JWT - Java - Passport - Axios",
              "cloud-and-db": "<br> AWS - PostgreSQL - MongoDB - MySQL - Supabase - Oracle - Sequelize - Prisma"
            }
          },
          "soft-skills": {
            "title": "soft-skills",
            "description": "<br>Beyond technical proficiency, I excel in teamwork, adaptability, and problem-solving. I thrive in collaborative environments, ensuring seamless integration of ideas and efficient project execution. My leadership and time management skills enable me to meet deadlines and handle multiple projects effectively. I am always eager to learn and adapt to new technologies, making me a valuable asset in dynamic and fast-paced work settings."
          }
        }
      },
      "personal-info": {
        "title": "personal-info",
        "icon": "icons/info-personal.svg",
        "info": {
          "bio": {
            "title": "bio",
            "description": "<br> About me <br> I am a passionate Computer and Systems Engineer dedicated to developing high-performance, user-centric applications. My journey in tech has been fueled by a continuous desire to learn and innovate, focusing on building scalable solutions that enhance user experience. I take pride in my ability to solve complex problems through efficient coding practices, cloud integration, and modern UI/UX strategies. My goal is to contribute to impactful projects that push the boundaries of technology while continuously growing as a professional."
          },
          "interests": {
            "title": "interests",
            "description": "<br>I am constantly learning and looking for content which can help me grow personally and professionally. I am passionate about technology, innovation, and entrepreneurship, and I enjoy exploring new tools and frameworks to enhance my skills. I am also an avid reader, with a keen interest in science fiction and fantasy novels. In my free time, I enjoy playing video games, watching movies, and spending time with my family and friends."
          },
          "education": {
            "title": "education",
            "description": "<br>I have always been passionate about computers and videogames, and that was the entry point for me to start studying systems engineering. Throughout my studies, i have gained a strong foundation in software development, cloud computing and db management. <br><br> Additionally, i have enhanced my technical knowledge through certifications, incluiding AWS and GitHub.",
            "files": {
              "university": "<br>I am a bachelor in Computer and Systems Engineering from the Universidad Pedagógica y Tecnológica de Colombia, i started my studies there in January 2019 and graduated in June 2024  <br><br> Also i have a bootcamp certificate in Cloud Architecture from the Universidad Sergio Arboleda, achieved in December 2024",
              "certifications": "<br>I have different certifications in AWS and GitHub<br><br> GitHub Foundations - August 2024<br><br> AWS Cloud Foundations - August 2024<br><br> AWS Cloud Architecting - August 2024"
            }
          }
        }
      },
      "hobbies-info": {
        "title": "hobbies-info",
        "icon": "icons/info-hobbies.svg",
        "info": {
          "books": {
            "title": "books",
            "description": "<br>I am an avid reader with a passion for science fiction and distopias. I enjoy exploring new worlds, characters, and ideas through books, expanding my imagination and creativity. Some of my favorite authors include Brandon Sanderson and George Orwell "
          },
          "favorite-games": {
            "title": "favorite-games",
            "description": "<br>I am a passionate gamer with interests in a wide range of genres, including competitive and single person games. I enjoy exploring new worlds, engaging in strategic battles, and collaborating with other players in multiplayer games. Some of my favorite games include Red Dead Redemption 2, Valorant, and the Halo series."
          },
          "movies-and-series": {
            "title": "movies-and-series",
            "description": "<br>I am a movie enthusiast with a keen interest in science fiction, fantasy, and action films. I enjoy exploring new cinematic experiences, engaging with complex characters, and immersing myself in captivating storylines. Some of my favorite movies include Interestellar, Spirited Away, and Inception"
          }
        }
      }
    }
  },
  "contacts": {
    "direct": {
      "title": "contacts",
      "sources": {
        "email": "miguel.rubiano343@gmail.com",
        "phone": "+57 3114582122"
      }
    },
    "social": {
      "github": {
        "title": "Github profile",
        "url": "https://github.com/",
        "user": "xArkqngel"
      },
      "linkedin": {
        "title": "LinkedIn profile",
        "url": "https://linkedin.com/in/",
        "user": "miguelrubiano343"
      }
    }
  },
  "gists": {},
  "projects": {
    "1": {
      "title": "_what-to-do",
      "description": "Kanban-type task tracking application. It allows the creation of boards, lists and tasks.",
      "img": "/images/projects/wtd.png",
      "tech": ["Next", "React", "Tailwind"],
      "url": "https://what-to-do-three.vercel.app/"
    },
    "2": {
      "title": "_sostecnible-web-page",
      "description": "Web page for Sostecnible SAS",
      "img": "/images/projects/sostecnible.png",
      "tech": ["Next", "React", "Tailwind"],
      "url": "https://www.sostecnible.com"
    },
    "3": {
      "title": "_what-the-chat-back",
      "description": "Backend for a real-time chat application, with the ability to create rooms and send messages.",
      "img": "/images/projects/ai-resources.png",
      "tech": ["Nest", "GraphQL"],
      "url": "https://github.com/xArkqngel/what-the-chat-backend"
    },
    "4": {
      "title": "_what-the-chat-front",
      "description": "Frontend for a real-time chat application, with the ability to create rooms and send messages.",
      "img": "/images/projects/worldmap.png",
      "tech": ["React"],
      "url": "https://github.com/xArkqngel/what-the-chat-ui"
    },
    "5": {
      "title": "_old-portfolio",
      "description": "Old portfolio developed in Astro",
      "img": "/images/projects/portfolio.png",
      "tech": ["Astro", "Tailwind"],
      "url": "https://xark-portfolio.netlify.app/"
    },
    "6": {
      "title": "_steam-top-100-games",
      "description": "Apollo GraphQL API that uses as data, the top 100 games on Steam and its DLCs, scraped from the Steam Store.",
      "img": "/images/projects/steam-top.png",
      "tech": ["GraphQL"],
      "url": "https://steam-top100-apollo-api.vercel.app/graphql"
    },
    "7": {
      "title": "_steam-clone",
      "description": "Steam Landing page clone using Astro and Tailwind CSS. Made as a personal project to learn Astro.",
      "img": "/images/projects/steam.png",
      "tech": ["Astro", "Tailwind"],
      "url": "https://xark-steam-clone.netlify.app/"
    }
  }
}
